cli/examples/validation/soap-Proxy/blz-soap.xml

<soap:Envelope
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:blz="http://thomas-bayer.com/blz/">
   <soap:Header/>
   <soap:Body>
      <blz:getBank>
         <blz:blz>38060186</blz:blz>
      </blz:getBank>
   </soap:Body>
</soap:Envelope>